app/controllers/cardtable_controller.rb

DELETE FROM "cardtables" WHERE 1=1
INSERT INTO "cardtables" ("bet", "dealer_id", "player_id", "updated_at", "created_at", "player", "game_id", "dealer", "deck") VALUES (0.0, 26, 25, '2011-11-11 23:26:22.043987', '2011-11-11 23:26:22.043987', '--- !ruby/object:Player
---
  def fresh

    # Delete any records that are in the table. Even if we have deleted them
    # after each game, the player may start a new game without finishing a
    # previous game normally, i.e. by repeatedly selecting "Start New..."
    Cardtable.delete_all

    # Create a new cardtable and initialise
    @cardtable = Cardtable.new
    @cardtable.startup(current_player)

    # Save this instance so we can get it and use it again
    @cardtable.save

SELECT "cardtables".* FROM "cardtables" LIMIT 1
UPDATE "cardtables" SET "bet" = 200.0, "updated_at" = '2011-11-11 23:09:36.422114', "dealer" = '--- !ruby/object:Player
---
  def buttonClick

    # There should only be one record in the database as there's only one
    # cardtable session in progress at any one time
    @cardtable = Cardtable.first

    # Find out which button was hit and perform the appropriate action
    if params[:submit] == "Deal"
      @cardtable.deal
    elsif params[:submit] == "Hit"
      @cardtable.hit
    elsif params[:submit] == "Stand"
      @cardtable.setBet(200)
    elsif params[:submit] == "Double"
      @cardtable.setBet(300)
    elsif params[:submit] == "Shuffle"
      @cardtable.shuffle
    end

    # Save this instance so we can get it and use it again
    @cardtable.save