app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.games_played, @user.games_lost, @user.games_won = 0, 0, 0
    @user.balance, @user.cashflow = 1000, 1000
    @user.num_sessions, @user.games_per_session_avg = 0, 0

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("games_played", "cashflow", "password_salt", "crypted_password", "username", "updated_at", "balance", "games_per_session_avg", "num_sessions", "created_at", "persistence_token", "games_lost", "games_won") VALUES (NULL, NULL, 'D4rvsYi3p0GV798m4QgW', '3cab705d8ba50444c402e29f633b65c9305bac1b5f04d6d2a4b518b8eeabeb768546f22603cf310f7e5f96397447bc63d2f604b886dc5109281b05e671c3ec00', 'charles', '2011-10-31 20:45:40.648904', NULL, NULL, NULL, '2011-10-31 20:45:40.648904', '487354b46f1421efef984b3012b158a381e3a8e108601925eb9bb785459f5bc80c8792634d1b38d6d0749c9605f7b4c4588e38818f409245d15132ebd6a0efd6', NULL, NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 19 LIMIT 1
UPDATE "users" SET "updated_at" = '2011-11-04 22:49:37.555067', "persistence_token" = 'b1c0a9cc4162d49137757d7de0296ea65e5cd93ce8fb0a85cc46d15846029347061abc33fedefe3f9db8ea06e6a5cdbb6007ace0be984c2253318d3d0962278d', "password_salt" = 'QlfulKmthZjAjIsvdNbB', "crypted_password" = '03022185449d5c6ba0a32518d9622a216b0dadc92cc65d13cfc2cbefa990b2b3fdb1169cabb731b353739118c9171fe84bf7c704b2285a033c259248bf135dc1' WHERE "users"."id" = 24